{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.20.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_asl_lstm",
        "layers": [
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_layer_1",
              "trainable": true,
              "batch_input_shape": [null, 30, 63],
              "dtype": "float32",
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "return_sequences": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_output_layer",
              "trainable": true,
              "units": 8,
              "activation": "softmax",
              "use_bias": true
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "lstm_layer_1/lstm_cell/kernel", "shape": [63, 256], "dtype": "float32"},
        {"name": "lstm_layer_1/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"},
        {"name": "lstm_layer_1/lstm_cell/bias", "shape": [256], "dtype": "float32"},
        {"name": "dense_output_layer/kernel", "shape": [64, 8], "dtype": "float32"},
        {"name": "dense_output_layer/bias", "shape": [8], "dtype": "float32"}
      ]
    }
  ]
}